import pytest

from src.services import search_by_individual, search_description


@pytest.fixture
def transactions():
    return [
        {
            'Дата операции': '30.12.2021 22:22:03',
            'Категория': 'Переводы',
            'Описание': 'Иван И.'
        },
        {
            'Дата операции': '30.12.2021 22:22:03',
            'Категория': 'поступление',
            'Описание': 'Константин Л.'
        },
        {
            'Дата операции': '31.12.2021 00:12:53',
            'Категория': 'Переводы',
            'Описание': 'Петр П.'
        },
        {
            'Дата операции': '30.12.2021 22:22:03',
            'Категория': 'Переводы',
            'Описание': 'Супермаркет'
        }
    ]


def test_search_description(transactions):
    assert search_description([], 'перевод') == []
    assert search_description(transactions, 'перевод') == [
        {
            'Дата операции': '30.12.2021 22:22:03',
            'Категория': 'Переводы',
            'Описание': 'Иван И.'
        },
        {
            'Дата операции': '31.12.2021 00:12:53',
            'Категория': 'Переводы',
            'Описание': 'Петр П.'
        },
        {
            'Дата операции': '30.12.2021 22:22:03',
            'Категория': 'Переводы',
            'Описание': 'Супермаркет'
        }
    ]


def test_search_by_individual(transactions):
    assert search_by_individual([]) == []
    assert search_by_individual(transactions) == [
        {
            'Дата операции': '30.12.2021 22:22:03',
            'Категория': 'Переводы',
            'Описание': 'Иван И.'
        },
        {
            'Дата операции': '31.12.2021 00:12:53',
            'Категория': 'Переводы',
            'Описание': 'Петр П.'
        }
    ]
